[
  {
    "query": "Found no NVIDIA driver",
    "message": "Found no NVIDIA driver on your system. Please check that you have an NVIDIA GPU and the latest drivers installed."
  },
  {
    "query": "The NVIDIA driver on your system is too old",
    "message": "The NVIDIA driver installed on your system is too old! If the drivers are up to date then your GPU is not compatible."
  },
  {
    "query": "no longer supports this GPU",
    "message": "The algorithm no longer supports your GPU."
  },
  {
    "query": "Buy new RAM!",
    "message": "You have run out of RAM on your system! Try a photo of smaller size or close all the programs you can."
  },
  {
    "query": "Stopped to avoid memory problems",
    "message": "You have run out of RAM on your system! Try a photo of smaller size or close all the programs you can."
  },
  {
    "query": "CUDA out of memory",
    "message": "You have run out of VRAM on your GPU! Try a photo of smaller size or close all the programs you can."
  },
  {
    "query": "codec can't decode byte",
    "message": "There was a problem saving the nudified photo. Please make sure the folders in Settings do not have special characters or spaces."
  },
  {
    "query": "The final result is not a valid image file",
    "message": "There was a problem saving the nudified photo. Please make sure you have enough disk space and the folders in Settings do not have special characters or spaces."
  },
  {
    "query": "invalid device ordinal",
    "message": "The selected GPU is not a valid device. Please make sure that the GPU option in Settings is valid."
  },
  {
    "query": "Image is not 512 x 512",
    "message": "Your photo needs to be 512x512 to be nudified. Please resize the photo with any of the DreamTime options or manually before uploading."
  },
  {
    "query": "loading Python",
    "message": "There was a problem loading the algorithm. Please reinstall DreamPower or make sure your operating system has the latest updates."
  },
  {
    "query": "DLL",
    "message": "There was a problem loading the algorithm. Please reinstall DreamPower or make sure your operating system has the latest updates."
  },
  {
    "query": "file is not valid image",
    "message": "There was a problem trying to load the photo. Please make sure it is a valid photo and has not been deleted."
  },
  {
    "query": "cv2.error",
    "message": "There was a problem trying to load the photo. Please ensure that it is a valid photo, that it has not been deleted or that the Cropper/Overlay are well positioned."
  },
  {
    "query": "is not a valid file or directory or url",
    "message": "There was a problem trying to load the photo. Please make sure it is a valid photo and has not been deleted."
  },
  {
    "query": "file not a supported format",
    "message": "There was a problem trying to load the photo. Please make sure it is a valid photo and has not been deleted."
  },
  {
    "query": "invalid extension format",
    "message": "There was a problem trying to load the photo. Please make sure it is a valid photo and has not been deleted."
  },
  {
    "query": "The file might be corrupted",
    "message": "There was a problem trying to load the photo. Please make sure it is a valid photo and has not been deleted."
  },
  {
    "query": "not compiled with CUDA",
    "message": "You have installed the CPU-only version of DreamPower. Please reinstall DreamPower to get GPU support."
  },
  {
    "query": "float division by zero",
    "message": "There was a problem cropping the photo. Please make sure you position the cropper correctly."
  },
  {
    "query": "CUDA error",
    "message": "Your GPU has reported a problem. Please make sure you have the latest drivers installed or reinstall it to fix any errors."
  },
  {
    "query": "Python was not found",
    "message": "There was a problem with DreamPower. Python is not installed on the system. Please disable the Use Python option if you are not using the algorithm source code."
  },
  {
    "query": "No module named",
    "message": "There was a problem with DreamPower. If you are using the algorithm source code please make sure you have installed the necessary modules, if you are not using the source code please disable the Use Python option or update your operating system."
  },
  {
    "query": "can't open file 'main.py'",
    "message": "There was a problem with DreamPower. If you are using the algorithm source code please make sure you have cloned the repository correctly or have configured the correct location, if you are not using the source code please disable the Use Python option."
  },
  {
    "query": "invalid choice",
    "message": "There was a problem with DreamPower. The installed version of DreamPower is not compatible with this version of DreamTime, please update the component."
  },
  {
    "query": "unrecognized arguments",
    "message": "There was a problem with DreamPower. The installed version of DreamPower is not compatible with this version of DreamTime, please update the component."
  },
  {
    "query": "Checkpoints file not found",
    "message": "There was a problem with DreamPower. The checkpoints could not be loaded, if you have changed the location of DreamPower please be sure to restart DreamTime and install the checkpoints."
  },
  {
    "query": "THCudaCheck FAIL",
    "message": "There was a problem with CUDA. This version of DreamPower may not be compatible with your operating system and it may be necessary to compile the project in your environment. Please visit our Chat or Forum for technical support."
  },
  {
    "query": "CUDNN_STATUS_ALLOC_FAILED",
    "message": "There was a problem with CUDA. Apparently there is another program using your GPU, please close that program and try again."
  },
  {
    "query": "CUDNN_STATUS_INTERNAL_ERROR",
    "message": "There was a problem with CUDA. Please make sure you have the latest drivers installed, that you have available memory and if you have installed CUDA or CUDNN that these are updated and configured."
  },
  {
    "query": "library load disallowed by system policy",
    "message": "There was a problem with DreamPower. Your operating system is configured to prevent the loading of applications that have not been verified by Apple. Please <a href='https://support.apple.com/en-us/HT202491' target='_blank'>click here</a> for information on how to solve this problem."
  }
]