[
  {
    "query": "Found no NVIDIA driver on your system",
    "message": "Found no NVIDIA driver on your system. Please check that you have an NVIDIA GPU and installed the latest driver."
  },
  {
    "query": "The NVIDIA driver on your system is too old",
    "message": "The NVIDIA driver installed on your system is too old! If the drivers are up to date then your GPU is not compatible."
  },
  {
    "query": "no longer supports this GPU",
    "message": "DreamTime no longer supports your GPU."
  },
  {
    "query": "Buy new RAM!",
    "message": "You have run out of RAM on your system! Try a photo of smaller size or close all the programs you can."
  },
  {
    "query": "CUDA out of memory",
    "message": "You have run out of VRAM on your GPU! Try a photo of smaller size or close all the programs you can."
  },
  {
    "query": "codec can't decode byte",
    "message": "The algorithm had a problem decoding some characters, this may be because one of the folders is in a path with characters that do not belong to the English alphabet. You can change this in the Folders section of Settings."
  },
  {
    "query": "invalid device ordinal",
    "message": "The selected GPU is not a valid device, please make sure that the GPU option in Settings is valid."
  },
  {
    "query": "Image is not 512 x 512",
    "message": "It is not possible to transform photos other than 512x512, please resize the photo with any of the DreamTime options or manually before uploading."
  },
  {
    "query": "loading Python",
    "message": "There was a problem loading the algorithm. Please reinstall DreamPower or make sure your operating system has the latest updates."
  },
  {
    "query": "DLL",
    "message": "There was a problem loading the algorithm. Please reinstall DreamPower or make sure your operating system has the latest updates."
  },
  {
    "query": "file is not valid image",
    "message": "There was a problem loading the photo, please make sure it is not corrupt."
  },
  {
    "query": "cv2.error",
    "message": "There was a problem loading the photo, please make sure it is not corrupt."
  },
  {
    "query": "not compiled with CUDA",
    "message": "You have installed the CPU-only version of DreamPower. Please reinstall DreamPower to obtain GPU support."
  }
]